# ComputeReferences Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Options..::..ComputeReferences Property
Options Class See Also
---
Determines whether or not references to geometric objects are computed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool ComputeReferences { get; set; }
```

Visual Basic
---
```text
Public Property ComputeReferences As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ComputeReferences {
	bool get ();
	void set (bool value);
}
```

# See Also
Options Class
Autodesk.Revit.DB Namespace